Extensions/АБ/InformationRegisters/УВМ_ЗначенияКонстант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_ЗначенияКонстант</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппировочноеИзмерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/АБ/InformationRegisters/АБ_ВнешниеНавигационныеСсылкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АБ_ВнешниеНавигационныеСсылкиДокументов</Name>
			<Comment>Миляев (295800) 2026-02-11</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/АБ/Enums/УВМ_ВариантыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_ВариантыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГОЗы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГОСы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАрендыОфиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАрендыСкладскихПомещений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорБанковскойГарантии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОбщехозяйственныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОказанияУслугПеревозкиГрузов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОТХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорПоручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСубсидирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорТЭУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЦессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждународныйДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/CommonModules/АБ_ВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает значение из регистра сведений "Значения констант"
//
// Параметры:
//  <СтруктураОтбора>                      - <Структура>     - набор "ключей" для отбора, значение "Ключ" - обязательное 
//  <ЗначениеПоУмолчанию>                  - <Любое значение>- если результат работы функции Неопределено, функция вернет это значение
//
// Возвращаемое значение:
//   <Значение>      - значение ресурса по заданному ключу, если несколько (возвращается первый) 
//                    - если ключ не найден возвращается "Неопределено" или ЗначениеПоУмолчанию, если оно задано
// Пример вызова:
//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("Ключ",                    "Тест1");
//		 	
//			Не обязательные отборы:
//		СтруктураОтбора.Вставить("ГруппировочноеИзмерение", "ТестГр1");
//		СтруктураОтбора.Вставить("Организация",           Орг1);
//		СтруктураОтбора.Вставить("КлючДополнительный",        "КлючДоп1");
//
//		УВМ_ОбщиеДоработкиСервер.ЗначениеКонстантыИзРегистра(СтруктураОтбора)
//
&НаСервере
Функция ЗначениеКонстантыИзРегистра(СтруктураОтбора, ЗначениеПоУмолчанию = Неопределено) Экспорт
    
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    УВМ_ЗначенияКонстант.Значение КАК Значение
	|ИЗ
	|    РегистрСведений.УВМ_ЗначенияКонстант КАК УВМ_ЗначенияКонстант
	|ГДЕ
	|    УВМ_ЗначенияКонстант.Ключ = &Ключ";
	
	ДопСтрока = "
	|    И УВМ_ЗначенияКонстант.Замена = &Замена";
	
	
	Для каждого ЭлементКоллекции Из СтруктураОтбора Цикл
		
		тКлюч = ЭлементКоллекции.Ключ;
		
		Запрос.УстановитьПараметр(тКлюч, ЭлементКоллекции.Значение);
		
		Если тКлюч <> "Ключ" Тогда 
			
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДопСтрока,"Замена",тКлюч);
			
		КонецЕсли;    
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = ЗначениеПоУмолчанию;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Значение;
	КонецЕсли;
	
	Возврат Результат;
    
КонецФункции

#Область ВнешниеНавигационныеСсылкиДокументов
// +++ Миляев (295800) 2026-01-23
Функция ПолучитьТекстHTMLПоВнешнимНавигационнымСсылкам(пОбъект) Экспорт
	
	Результат = "";
	ВнешнийАдресБазы = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","АдресСервераВнешнийДоступ_ЕРПОсн"),Неопределено);
	Если ВнешнийАдресБазы = Неопределено тогда
		Возврат Результат;
	КонецЕсли;
	ДокументПредприятия = ДокументПредприятия(пОбъект);
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументПредприятия",ДокументПредприятия);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АБ_ВнешниеНавигационныеСсылкиДокументов.Раздел КАК Раздел,
		|	АБ_ВнешниеНавигационныеСсылкиДокументов.НавигационнаяСсылка КАК НавигационнаяСсылка,
		|	АБ_ВнешниеНавигационныеСсылкиДокументов.ПредставлениеСсылки КАК ПредставлениеСсылки
		|ИЗ
		|	РегистрСведений.АБ_ВнешниеНавигационныеСсылкиДокументов КАК АБ_ВнешниеНавигационныеСсылкиДокументов
		|ГДЕ
		|	АБ_ВнешниеНавигационныеСсылкиДокументов.ДокументПредприятия = &ДокументПредприятия
		|ИТОГИ ПО
		|	Раздел";
	ВыборкаРазделов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРазделов.Следующий() цикл
		Результат = СтрШаблон("%1<br>%2<ul>",Результат,ВыборкаРазделов.Раздел);
		ВыборкаСсылок = ВыборкаРазделов.Выбрать();
		Пока ВыборкаСсылок.Следующий() цикл
			НавигационнаяСсылка = СтрШаблон("%1#%2",ВнешнийАдресБазы,ВыборкаСсылок.НавигационнаяСсылка);
			Результат = СтрШаблон("%1<li><a href=""%2"">%3</a></li>",Результат,НавигационнаяСсылка,ВыборкаСсылок.ПредставлениеСсылки);
		КонецЦикла;
		Результат = СтрШаблон("%1%2",Результат,"</ul>");
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ДокументПредприятия(пОбъект) Экспорт
	Если ТипЗнч(пОбъект) = Тип("ДокументОбъект.Задача") тогда
		Возврат ДокументПредприятия(пОбъект.Источник);
	ИначеЕсли ТипЗнч(пОбъект) = Тип("ДокументСсылка.Задача") тогда
		Возврат ДокументПредприятия(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пОбъект,"Источник"));
	ИначеЕсли ТипЗнч(пОбъект) = Тип("БизнесПроцессСсылка.Исполнение") тогда
		ТЧПредметы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пОбъект,"Предметы");
		ТЧПредметы = ТЧПредметы.Выбрать();
		Пока ТЧПредметы.Следующий() цикл
			Если ЗначениеЗаполнено(ТЧПредметы.Предмет) И ТипЗнч(ТЧПредметы.Предмет)=Тип("СправочникСсылка.ДокументыПредприятия") тогда
				Возврат ТЧПредметы.Предмет;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(пОбъект) = Тип("БизнесПроцессОбъект.Исполнение") тогда
		ТЧпредметы = пОбъект.Предметы;
		Для Каждого лЗаписьТЧ из ТЧпредметы цикл
			Если ЗначениеЗаполнено(лЗаписьТЧ.Предмет) И ТипЗнч(лЗаписьТЧ.Предмет)=Тип("СправочникСсылка.ДокументыПредприятия") тогда
				Возврат лЗаписьТЧ.Предмет;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(пОбъект) = Тип("СправочникОбъект.ДокументыПредприятия") тогда
		Возврат пОбъект.Ссылка;
	ИначеЕсли ТипЗнч(пОбъект) = Тип("СправочникСсылка.ДокументыПредприятия") тогда
		Возврат пОбъект;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьВнешниеСсылкиПоИННКонтрагентов(пИНН, пВидДокумента, пТипДоговора="СПокупателем", пРаздел="Действующие договоры") Экспорт
	
	СтруктураОтвет = ВыполнитьЗапросКоВнешнейБазеПоДействующимДоговорам(пИНН,пТипДоговора);
	Если СтруктураОтвет = Неопределено или ТипЗнч(СтруктураОтвет) <> Тип("Структура") тогда
		Возврат;
	КонецЕсли;
	ВнестиИнформациюОВнешнихСсылкахПоВнешнимДоговорам(СтруктураОтвет, пВидДокумента, пРаздел);
	
КонецПроцедуры 

Процедура ЗагрузитьВнешниеСсылкиДействующихДоговоровПоДокументам() Экспорт
	
	ВидДокументов = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ВД_ДоговорПоставкиМыПоставщик"),Неопределено);
	Если не ЗначениеЗаполнено(ВидДокументов) тогда
		Возврат;
	КонецЕсли;  
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВидДокумента",ВидДокументов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументыПредприятия.Контрагент.ИНН КАК КонтрагентИНН
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|	    ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.КомплексныйПроцесс.Предметы КАК КомплексныйПроцессПредметы
	|	    ПО (КомплексныйПроцессПредметы.Предмет = ДокументыПредприятия.Ссылка)
	|	    ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.КомплексныйПроцесс КАК КомплексныйПроцесс
	|	    ПО (КомплексныйПроцессПредметы.Ссылка = КомплексныйПроцесс.Ссылка)
	|ГДЕ
	|	ДокументыПредприятия.ВидДокумента = &ВидДокумента
	|	И НЕ ЕСТЬNULL(КомплексныйПроцесс.Завершен,Ложь)";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивИНН = Новый Массив();
	Пока Выборка.Следующий() цикл
		Если ЗначениеЗаполнено(Выборка.КонтрагентИНН) тогда
			МассивИНН.Добавить(Выборка.КонтрагентИНН);
		КонецЕсли;
	КонецЦикла;
	
	ЗагрузитьВнешниеСсылкиПоИННКонтрагентов(МассивИНН,ВидДокументов,"СПокупателем","Действующие договоры");
КонецПроцедуры

Функция ДанныеДляПодключенияHTTP_GetInfo_ERP_Основная() Экспорт
	//++dar 21.04.26 (доступ пользователям к РС.БезопасноеХранилищеДанных)
	УстановитьПривилегированныйРежим(Истина);
	//--dar 21.04.26 (доступ пользователям к РС.БезопасноеХранилищеДанных)
	Результат = Новый Структура();
	Результат.Вставить("СерверHTTP"        ,АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","АдресСервераHTTP_ЕРПОсн"),"127.0.0.1"));
	Результат.Вставить("ИмяHTTPПубликации" ,АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ИмяБазыHTTP_ЕРПОсн"),""));
	Результат.Вставить("ЛогинПользователя" ,АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ЛогинHTTP_ЕРПОсн"),""));
	Результат.Вставить("ПарольПользователя",ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(СтрШаблон("Пароль_%1",Результат.ЛогинПользователя)));
	Возврат Результат;
КонецФункции

Функция МассивДействующихДоговоровИзВнешнейБазы(пИНН,пТипДоговора="СПокупателем") Экспорт

	Возврат ВыполнитьЗапросКоВнешнейБазеПоДействующимДоговорам(пИНН,пТипДоговора);
	
КонецФункции

Функция ВыполнитьЗапросКоВнешнейБазеПоДействующимДоговорам(пИНН,пТипДоговора) Экспорт
	Если ТипЗнч(пИНН) = Тип("Строка") И ЗначениеЗаполнено(пИНН) тогда
		МассивИНН = Новый Массив();
		МассивИНН.Добавить(пИНН);
	ИначеЕсли ТипЗнч(пИНН) = Тип("Массив") И пИНН.Количество()>0 тогда
		МассивИНН = пИНН;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляПодключенияGetInfo = ДанныеДляПодключенияHTTP_GetInfo_ERP_Основная();
	СтруктураДляЗапроса = Новый Структура("ИНН,ТипДоговора",МассивИНН,пТипДоговора);
	
	//++dar 24.04.26 (с помощью АБ_КоннекторHTTP)
	//СоединениеHTTP = Новый HTTPСоединение(ДанныеДляПодключенияGetInfo.СерверHTTP,,ДанныеДляПодключенияGetInfo.ЛогинПользователя,ДанныеДляПодключенияGetInfo.ПарольПользователя);
	//ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1/hs/getinfo/v1/getcurrentcontractsbyinn",ДанныеДляПодключенияGetInfo.ИмяHTTPПубликации));
	//ЗапросHTTP.УстановитьТелоИзСтроки(СериализацияJson(СтруктураДляЗапроса),КодировкаТекста.UTF8);
	//Ответ = СоединениеHTTP.Получить(ЗапросHTTP);
	//Если Ответ.КодСостояния<>200 тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//Возврат ДесериализацияJson(Ответ.ПолучитьТелоКакСтроку());
	
	URL = СтрШаблон("http://%1/%2/hs/getinfo/v1/getcurrentcontractsbyinn", ДанныеДляПодключенияGetInfo.СерверHTTP, ДанныеДляПодключенияGetInfo.ИмяHTTPПубликации);
	
	ПараметрыЗапроса = АБ_КоннекторHTTP.НовыеПараметры();
	ПараметрыЗапроса.Аутентификация = АБ_КоннекторHTTP.НоваяАутентификацияBasic(ДанныеДляПодключенияGetInfo.ЛогинПользователя, ДанныеДляПодключенияGetInfo.ПарольПользователя);
	ПараметрыЗапроса.ПроверятьSSL = Ложь;
	ПараметрыЗапроса.Json = СтруктураДляЗапроса;
	
	ОтветHTTP = АБ_КоннекторHTTP.Post(URL, Неопределено, ПараметрыЗапроса);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АБ_КоннекторHTTP.КакJson(ОтветHTTP, Новый Структура("ПрочитатьВСоответствие", Ложь));
	//--dar 24.04.26 (с помощью АБ_КоннекторHTTP)

КонецФункции

Процедура ВнестиИнформациюОВнешнихСсылкахПоВнешнимДоговорам(пСтруктураОтвет,пВидДокумента, пРаздел="Действующие договоры") Экспорт
	ВнешниеСсылки = Неопределено;
	пСтруктураОтвет.Свойство("ДоговорыНавСсылки",ВнешниеСсылки); 
	Если ВнешниеСсылки = неопределено тогда
		Возврат;
	КонецЕсли;  
	Если не ЗначениеЗаполнено(пВидДокумента) тогда
    	Возврат;
	КонецЕсли;
	
	ТаблицаДляЗапроса = Новый ТаблицаЗначений();
	ТаблицаДляЗапроса.Колонки.Добавить("ИНН",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаДляЗапроса.Колонки.Добавить("Раздел",ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДляЗапроса.Колонки.Добавить("НавигационнаяСсылка",ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаДляЗапроса.Колонки.Добавить("ПредставлениеСсылки",ОбщегоНазначения.ОписаниеТипаСтрока(250));
	Для Каждого ЭлементВнешСсылки из ВнешниеСсылки цикл
		НовЗаписьТЗ = ТаблицаДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НовЗаписьТЗ,ЭлементВнешСсылки);
		НовЗаписьТЗ.Раздел = пРаздел;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаВнешнихСсылок",ТаблицаДляЗапроса);
	Запрос.УстановитьПараметр("ВидДокумента",пВидДокумента);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВнешнихСсылок.ИНН КАК ИНН,
	|	ТаблицаВнешнихСсылок.Раздел КАК Раздел,
	|	ТаблицаВнешнихСсылок.НавигационнаяСсылка КАК НавигационнаяСсылка,
	|	ТаблицаВнешнихСсылок.ПредставлениеСсылки КАК ПредставлениеСсылки
	|ПОМЕСТИТЬ ТаблицаВнешнихСсылокВрем
	|ИЗ
	|	&ТаблицаВнешнихСсылок КАК ТаблицаВнешнихСсылок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументыПредприятия.Ссылка КАК ДокументПредприятия,
	|	ДокументыПредприятия.Контрагент.ИНН КАК КонтрагентИНН
	|ПОМЕСТИТЬ НезавершенныеДокументы
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.КомплексныйПроцесс.Предметы КАК КомплексныйПроцессПредметы
	|		ПО (КомплексныйПроцессПредметы.Предмет = ДокументыПредприятия.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.КомплексныйПроцесс КАК КомплексныйПроцесс
	|		ПО (КомплексныйПроцессПредметы.Ссылка = КомплексныйПроцесс.Ссылка)
	|ГДЕ
	|	ДокументыПредприятия.ВидДокумента = &ВидДокумента
	|	И НЕ ЕСТЬNULL(КомплексныйПроцесс.Завершен, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВнешнихСсылокВрем.Раздел КАК Раздел,
	|	ТаблицаВнешнихСсылокВрем.НавигационнаяСсылка КАК НавигационнаяСсылка,
	|	ТаблицаВнешнихСсылокВрем.ПредставлениеСсылки КАК ПредставлениеСсылки,
	|	НезавершенныеДокументы.ДокументПредприятия КАК ДокументПредприятия
	|ПОМЕСТИТЬ ДанныеДляРегистраВнешнихСсылок
	|ИЗ
	|	ТаблицаВнешнихСсылокВрем КАК ТаблицаВнешнихСсылокВрем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НезавершенныеДокументы КАК НезавершенныеДокументы
	|		ПО ТаблицаВнешнихСсылокВрем.ИНН = НезавершенныеДокументы.КонтрагентИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРегистраВнешнихСсылок.ДокументПредприятия КАК ДокументПредприятия,
	|	ДанныеДляРегистраВнешнихСсылок.Раздел КАК Раздел,
	|	ДанныеДляРегистраВнешнихСсылок.НавигационнаяСсылка КАК НавигационнаяСсылка,
	|	ДанныеДляРегистраВнешнихСсылок.ПредставлениеСсылки КАК ПредставлениеСсылки
	|ИЗ
	|	ДанныеДляРегистраВнешнихСсылок КАК ДанныеДляРегистраВнешнихСсылок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АБ_ВнешниеНавигационныеСсылкиДокументов КАК АБ_ВнешниеНавигационныеСсылкиДокументов
	|		ПО ДанныеДляРегистраВнешнихСсылок.ДокументПредприятия = АБ_ВнешниеНавигационныеСсылкиДокументов.ДокументПредприятия
	|			И ДанныеДляРегистраВнешнихСсылок.ПредставлениеСсылки = АБ_ВнешниеНавигационныеСсылкиДокументов.ПредставлениеСсылки
	|			И ДанныеДляРегистраВнешнихСсылок.Раздел = АБ_ВнешниеНавигационныеСсылкиДокументов.Раздел
	|			И ДанныеДляРегистраВнешнихСсылок.НавигационнаяСсылка = АБ_ВнешниеНавигационныеСсылкиДокументов.НавигационнаяСсылка
	|ГДЕ
	|	АБ_ВнешниеНавигационныеСсылкиДокументов.ДокументПредприятия ЕСТЬ NULL
	|ИТОГИ ПО
	|	ДокументПредприятия,
	|	Раздел";
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() цикл
		ВыборкаРаздел = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРаздел.Следующий() цикл
			НаборЗаписейРСВ = РегистрыСведений.АБ_ВнешниеНавигационныеСсылкиДокументов.СоздатьНаборЗаписей();
			НаборЗаписейРСВ.Отбор.ДокументПредприятия.Установить(ВыборкаДокумент.ДокументПредприятия);
			НаборЗаписейРСВ.Отбор.Раздел.Установить(ВыборкаРаздел.Раздел);
			НаборЗаписейРСВ.Прочитать();
			НаборЗаписейРСВ.Очистить();
			
			СчетчикСтрок = 1;
			ВыборкаДет = ВыборкаРаздел.Выбрать();
			Пока ВыборкаДет.Следующий() цикл
				ЗаписьНЗ = НаборЗаписейРСВ.Добавить();
				ЗаписьНЗ.НавигационнаяСсылка = ВыборкаДет.НавигационнаяСсылка;
				ЗаписьНЗ.ПредставлениеСсылки = ВыборкаДет.ПредставлениеСсылки;
				ЗаписьНЗ.ДопКлюч             = Формат(СчетчикСтрок,"ЧЦ=5; ЧВН=; ЧГ=");
				ЗаписьНЗ.Раздел              = ВыборкаРаздел.Раздел;
				ЗаписьНЗ.ДокументПредприятия = ВыборкаДокумент.ДокументПредприятия;
				СчетчикСтрок = СчетчикСтрок + 1;
			КонецЦикла;
		КонецЦикла;
		
		НаборЗаписейРСВ.Записать();
	КонецЦикла;
КонецПроцедуры
// --- Миляев (295800) 2026-01-23

//++dar 04.03.26 (309302)
Процедура СоздатьДоговорВоВнешнейБазе(Документ) Экспорт
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Наименование, ВидДокумента, УВМ_КоличествоДнейОтсрочки, 
																			 |УВМ_ПроцентНеустойки, УВМ_ТипНеустойки, Ответственный.Наименование,
																			 |УВМ_ВидАгентскогоДоговора, УВМ_НалогообложениеНДС, УВМ_НалогообложениеНДСОпределяетсяВДокументе,
																			 //++GIV 24032026 (320030)
																			 |УВМ_СтавкаНДС.Наименование, СуммаНДС, РегистрационныйНомер, ДатаСоздания"); 
																			 //--GIV 24032026 (320030)
	
	СтруктураДляЗапроса = Новый Структура;
	СтруктураДляЗапроса.Вставить("ВидДокументаДОID", XMLСтрока(РеквизитыДоговора.ВидДокумента.УникальныйИдентификатор()));//гуид вида договора из ДО
	СтруктураДляЗапроса.Вставить("ОсновнойПредметID", XMLСтрока(Документ.УникальныйИдентификатор()));//гуид договора из ДО(справочник документы предприятия)
	СтруктураДляЗапроса.Вставить("ОсновнойПредметТип", "DMDocument");
	СтруктураДляЗапроса.Вставить("УВМ_КоличествоДнейОтсрочки", РеквизитыДоговора.УВМ_КоличествоДнейОтсрочки);
	СтруктураДляЗапроса.Вставить("УВМ_ПроцентНеустойки", РеквизитыДоговора.УВМ_ПроцентНеустойки);
	//++GIV 24032026 (320030)
	СтруктураДляЗапроса.Вставить("Дата", РеквизитыДоговора.ДатаСоздания);
	СтруктураДляЗапроса.Вставить("Номер", РеквизитыДоговора.РегистрационныйНомер);
	//--GIV 24032026 (320030)
	
	СтруктураДляЗапроса.Вставить("УВМ_ТипНеустойки", Неопределено);
	Если ЗначениеЗаполнено(РеквизитыДоговора.УВМ_ТипНеустойки) Тогда
		СтруктураДляЗапроса.Вставить("УВМ_ТипНеустойки", ОбщегоНазначения.ИмяЗначенияПеречисления(РеквизитыДоговора.УВМ_ТипНеустойки)); 
	КонецЕсли;
	
	СтруктураДляЗапроса.Вставить("Менеджер", РеквизитыДоговора.ОтветственныйНаименование);
	СтруктураДляЗапроса.Вставить("НаименованиеДоговора", РеквизитыДоговора.Наименование);
	
	//для раздела Налогообложение
	СтруктураДляЗапроса.Вставить("ВидАгентскогоДоговора", Неопределено);
	Если ЗначениеЗаполнено(РеквизитыДоговора.УВМ_ВидАгентскогоДоговора) Тогда
		СтруктураДляЗапроса.Вставить("ВидАгентскогоДоговора", ОбщегоНазначения.ИмяЗначенияПеречисления(РеквизитыДоговора.УВМ_ВидАгентскогоДоговора));
	КонецЕсли;
	
	СтруктураДляЗапроса.Вставить("НалогообложениеНДС", Неопределено);
	Если ЗначениеЗаполнено(РеквизитыДоговора.УВМ_НалогообложениеНДС) Тогда
		СтруктураДляЗапроса.Вставить("НалогообложениеНДС", ОбщегоНазначения.ИмяЗначенияПеречисления(РеквизитыДоговора.УВМ_НалогообложениеНДС));
	КонецЕсли;
	
	СтруктураДляЗапроса.Вставить("НалогообложениеНДСОпределяетсяВДокументе", РеквизитыДоговора.УВМ_НалогообложениеНДСОпределяетсяВДокументе);
	Если ЗначениеЗаполнено(РеквизитыДоговора.УВМ_СтавкаНДСНаименование) Тогда
		СтруктураДляЗапроса.Вставить("СтавкаНДС", РеквизитыДоговора.УВМ_СтавкаНДСНаименование);
	Иначе
		СтруктураДляЗапроса.Вставить("СтавкаНДС", "22%");
	КонецЕсли;
	СтруктураДляЗапроса.Вставить("УВМ_СуммаНДС", РеквизитыДоговора.СуммаНДС);
	
	ДанныеДляПодключенияGetInfo = ДанныеДляПодключенияHTTP_GetInfo_ERP_Основная();
	
	СоединениеHTTP = Новый HTTPСоединение(ДанныеДляПодключенияGetInfo.СерверHTTP,,ДанныеДляПодключенияGetInfo.ЛогинПользователя,ДанныеДляПодключенияGetInfo.ПарольПользователя);
	ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1/hs/getinfo/v1/create_contract",ДанныеДляПодключенияGetInfo.ИмяHTTPПубликации));
	ЗапросHTTP.УстановитьТелоИзСтроки(АБ_ВызовСервера.СериализацияJson(СтруктураДляЗапроса),КодировкаТекста.UTF8);
	Ответ = СоединениеHTTP.ВызватьHTTPМетод("POST", ЗапросHTTP);
	Если Ответ.КодСостояния<>200 тогда
		//++GIV 25032026 (320030) Если не 200 то откуда json
		//ТекстОтвета = АБ_ВызовСервера.ДесериализацияJson(Ответ.ПолучитьТелоКакСтроку());
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();  
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка при передаче договора в ERP %1", ТекстОтвета));
		ЗаписьЖурналаРегистрации("УВМ_ОшибкаСозданияДоговораВЕРП", УровеньЖурналаРегистрации.Ошибка, , , СтрШаблон("Возникла ошибка при создании договора в ЕРП %1", ТекстОтвета));
		Если ОбщегоНазначения.РежимОтладки() Тогда
			ВызватьИсключение(СтрШаблон("Ошибка при передаче договора в ERP %1", ТекстОтвета),КатегорияОшибки.ОшибкаСети,Ответ.КодСостояния);
		КонецЕсли;
		//--GIV 25032026 (320030)
	КонецЕсли;

КонецПроцедуры
//--dar 04.03.26 (309302)

//++dar 11.03.26 (309302)
Процедура УВМ_УдалитьПомеченныеФайлыИзСведений(Документ) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецФайла", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОФайлахДокументооборот.Файл КАК Файл
	|ИЗ
	|	РегистрСведений.СведенияОФайлахДокументооборот КАК СведенияОФайлахДокументооборот
	|ГДЕ
	|	СведенияОФайлахДокументооборот.Файл.ВладелецФайла = &ВладелецФайла
	|	И СведенияОФайлахДокументооборот.Файл.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.СведенияОФайлахДокументооборот.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Файл = Выборка.Файл;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
КонецПроцедуры
//--dar 11.03.26 (309302)

//++dar 30.04.26 (326008)
// Функция возвращает процент НДС.
//
// Параметры:
//	СтавкаНДС - СправочникСсылка.СтавкиНДС - Значение ставки НДС.
//
// Возвращаемое значение:
//	Число - Процент НДС.
//
Функция ЗначениеСтавкиНДС(СтавкаНДС) Экспорт
	
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат 0;
	КонецЕсли;

	Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка");
		
	//++ Локализация
	
	ИначеЕсли ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
			Возврат 10;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
			Возврат 18;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
			Возврат 20;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") Тогда
			Возврат 22;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105") Тогда
			Возврат 5;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107") Тогда
			Возврат 7;
		КонецЕсли;
		
	//-- Локализация
		
	КонецЕсли;
	
КонецФункции
//--dar 30.04.26 (326008)

#КонецОбласти  

//++dar 25.02.26 (309302)
Функция УВМ_ПолучитьИмяФайлаWord(Документ, КаталогВФ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДДФайла", "");
	Результат.Вставить("ПолноеИмяФайла", "");
	Результат.Вставить("НаименованиеФайла", "");
	
	МассивКомбинацийРолей = Новый Массив;
	РольДоговор = Новый Структура;
	РольДоговор.Вставить("Обязательная", Истина);
	РольДоговор.Вставить("Роль", УВМ_РольФайлаДоговор());
	МассивКомбинацийРолей.Добавить(РольДоговор);
	
	ТаблицаФайлы = Делопроизводство.ПолучитьДанныеФайловДляСписка(Неопределено, Документ, 
		Ложь, Ложь,
		МассивКомбинацийРолей);
		
	СтрокаДокумент = Неопределено;
	СтрокаDOC = ТаблицаФайлы.Найти("doc", "Расширение");
	Если СтрокаDOC <> Неопределено Тогда
		СтрокаДокумент = СтрокаDOC;
	Иначе	
		СтрокаDOCX = ТаблицаФайлы.Найти("docx", "Расширение");
		Если СтрокаDOCX <> Неопределено Тогда
			СтрокаДокумент = СтрокаDOCX;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДокумент <> Неопределено Тогда
		ПолноеИмяФайла = "";
		НаименованиеФайла = "";
	
		ДДФайла = РаботаСФайламиВызовСервера.ПолучитьДвоичныеДанныеФайла(СтрокаДокумент.Ссылка);
		ПолноеИмяФайла = СтрШаблон("%1%2.%3", КаталогВФ, СтрокаДокумент.Наименование, СтрокаДокумент.Расширение);
		НаименованиеФайла = СтрокаДокумент.Наименование;
	
		Результат.Вставить("ДДФайла", ДДФайла);
		Результат.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
		Результат.Вставить("НаименованиеФайла", НаименованиеФайла);
	КонецЕсли;
	
	АдресФайла = ПоместитьВоВременноеХранилище(Результат);

	Возврат АдресФайла;
	
КонецФункции

Функция УВМ_РольФайлаДоговор() Экспорт
	Возврат ЗначениеКонстантыИзРегистра(Новый Структура("Ключ", "УВМ_РольФайлаДоговор"));
КонецФункции

Функция УВМ_ПолучателиПисем(МассивДокументов) Экспорт

	Результат = Новый Соответствие;

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУведомленияПользователя") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПредприятияСтороны.Ссылка КАК Документ,
	|	ДокументыПредприятияСтороны.УВМ_Почта КАК УВМ_Почта
	|ИЗ
	|	Справочник.ДокументыПредприятия.Стороны КАК ДокументыПредприятияСтороны
	|ГДЕ
	|	ДокументыПредприятияСтороны.Ссылка В (&МассивДокументов)
	|	И ДокументыПредприятияСтороны.Сторона ССЫЛКА Справочник.Контрагенты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МсвПолучателей = СтрРазделить(СтрЗаменить(Выборка.УВМ_Почта, " ", ""), ",", Ложь);
		Результат.Вставить(Выборка.Документ, МсвПолучателей);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//--dar 25.02.26 (309302)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// +++ Миляев (295800) 2026-01-23

Функция СериализацияJson(Значение) Экспорт
	Настройки = Новый НастройкиСериализацииJSON();
	Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;
КонецФункции

Функция ДесериализацияJson(СтрокаJSON, ПоляДата = "") Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	Возврат Значение;
КонецФункции

// --- Миляев (295800) 2026-01-23

#КонецОбласти

#Область ОбзорДокумента_РеквизитыДоговоровАренды

//++dar 23.04.26 (324174)                        
Функция ПолучитьТекстHTMLПоРеквизитамДоговораАренды(пДокумент) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", пДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыПредприятия.УВМ_ВариантДоговора КАК УВМ_ВариантДоговора,
	|	ДокументыПредприятия.УВМ_ПлощадьНежилогоПомещения КАК УВМ_ПлощадьНежилогоПомещения,
	|	ДокументыПредприятия.УВМ_ПлощадьЗдания КАК УВМ_ПлощадьЗдания,
	|	ДокументыПредприятия.УВМ_ЭтажЗдания КАК УВМ_ЭтажЗдания,
	|	ДокументыПредприятия.УВМ_КадастровыйНомерЗдания КАК УВМ_КадастровыйНомерЗдания,
	|	ДокументыПредприятия.УВМ_КадастровыйНомерУчастка КАК УВМ_КадастровыйНомерУчастка,
	|	ДокументыПредприятия.УВМ_АдресОбъекта КАК УВМ_АдресОбъекта,
	|	ДокументыПредприятия.УВМ_ПередаваемоеОборудование КАК УВМ_ПередаваемоеОборудование,
	|	ДокументыПредприятия.УВМ_ОснованиеПраваСобственности КАК УВМ_ОснованиеПраваСобственности,
	|	ДокументыПредприятия.УВМ_СрокПередачиОбъектаАрендодателем КАК УВМ_СрокПередачиОбъектаАрендодателем,
	|	ДокументыПредприятия.УВМ_СрокПринятияОбъектаАрендатором КАК УВМ_СрокПринятияОбъектаАрендатором,
	|	ДокументыПредприятия.УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты КАК УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты,
	|	ДокументыПредприятия.УВМ_НДСВСоставеАренднойПлаты КАК УВМ_НДСВСоставеАренднойПлаты,
	|	ДокументыПредприятия.УВМ_АренднаяПлатаЗаПользованиеОборудованием КАК УВМ_АренднаяПлатаЗаПользованиеОборудованием,
	|	ДокументыПредприятия.УВМ_ОснащениеИмущества КАК УВМ_ОснащениеИмущества,
	|	ДокументыПредприятия.УВМ_ДополнительноПереданныеДокументыИПредметы КАК УВМ_ДополнительноПереданныеДокументыИПредметы,
	|	ДокументыПредприятия.УВМ_ПоказанияПриборовУчётаНаМоментПередачи КАК УВМ_ПоказанияПриборовУчётаНаМоментПередачи
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|ГДЕ
	|	ДокументыПредприятия.Ссылка = &Документ
	|	И (ДокументыПредприятия.УВМ_ВариантДоговора = ЗНАЧЕНИЕ(Перечисление.УВМ_ВариантыДоговоров.ДоговорАрендыОфиса)
	|			ИЛИ ДокументыПредприятия.УВМ_ВариантДоговора = ЗНАЧЕНИЕ(Перечисление.УВМ_ВариантыДоговоров.ДоговорАрендыСкладскихПомещений))";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДоговорАрендыОфиса = (Выборка.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыОфиса); 
		ДоговорАрендыСкладскогоПомещения = (Выборка.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыСкладскихПомещений);
		
		Результат = СтрШаблон("Реквизиты аренды %1", "<br>");
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Площадь нежилого помещения/части нежилого помещения (кв. м.)", Выборка.УВМ_ПлощадьНежилогоПомещения);
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Площадь здания (кв. м.)", Выборка.УВМ_ПлощадьЗдания);
		Если ДоговорАрендыОфиса Тогда
			Результат = СтрШаблон("%1<br>%2: %3", Результат, "Этаж здания", Выборка.УВМ_ЭтажЗдания);
		КонецЕсли;
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Кадастровый номер здания", Выборка.УВМ_КадастровыйНомерЗдания);
		Если ДоговорАрендыСкладскогоПомещения Тогда
			Результат = СтрШаблон("%1<br>%2: %3", Результат, "Кадастровый номер участка", Выборка.УВМ_КадастровыйНомерУчастка);
		КонецЕсли;
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Адрес объекта", Выборка.УВМ_АдресОбъекта);
		Если ДоговорАрендыСкладскогоПомещения Тогда
			Результат = СтрШаблон("%1<br>%2: %3", Результат, "Вместе с Объектом в аренду Арендатору передается следующее оборудование", Выборка.УВМ_ПередаваемоеОборудование);
		КонецЕсли;
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Объект принадлежит Арендодателю на праве собственности (аренды) на основании следующих документов", Выборка.УВМ_ОснованиеПраваСобственности);
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Арендодатель обязан передать Объект аренды по акту приема-передачи в срок до", Формат(Выборка.УВМ_СрокПередачиОбъектаАрендодателем, "ДФ=dd.MM.yyyy"));
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Арендатор обязан принять Объект от Арендодателя по акту приема-передачи до", Формат(Выборка.УВМ_СрокПринятияОбъектаАрендатором, "ДФ=dd.MM.yyyy"));
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Ежемесячная постоянная часть арендной платы составляет (рублей в месяц)", Выборка.УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты);
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "В т.ч. НДС", Выборка.УВМ_НДСВСоставеАренднойПлаты);
		Если ДоговорАрендыСкладскогоПомещения Тогда
			Результат = СтрШаблон("%1<br>%2: %3", Результат, "Арендная плата за пользование оборудованием составляет", Выборка.УВМ_АренднаяПлатаЗаПользованиеОборудованием);
		КонецЕсли;
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Имущество оснащено (данные, указанные через запятую, будут отображены с новой строки)", Выборка.УВМ_ОснащениеИмущества);
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Вместе с передачей Имущества представителю Арендатора переданы", Выборка.УВМ_ДополнительноПереданныеДокументыИПредметы);
		Результат = СтрШаблон("%1<br>%2: %3", Результат, "Показания приборов учета на момент передачи Имущества (данные, указанные через запятую, будут отображены с новой строки)", Выборка.УВМ_ПоказанияПриборовУчётаНаМоментПередачи);
		Результат = СтрШаблон("%1<br>", Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//--dar 23.04.26 (324174)                        

#КонецОбласти
